letrongminh/neuroedge-init/targets/esp32s3/sdkconfig.defaults
# Target & Architecture
CONFIG_IDF_TARGET="esp32s3"
CONFIG_IDF_TARGET_ESP32S3=y

# Flash & Memory
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# PSRAM Configuration (ESP32-S3-Box-3 has 8MB Octal PSRAM)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_BOOT_INIT=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MEMTEST=y

# FreeRTOS 1000Hz Tick Rate for precise audio scheduling
CONFIG_FREERTOS_HZ=1000

# Compiler Optimization for Performance
CONFIG_COMPILER_OPTIMIZATION_PERF=y
